# Используем образ Python версии 3.9 в качестве базового
FROM python:3.9

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем файл с зависимостями в рабочую директорию
COPY requirements.txt ./

# Устанавливаем зависимости из файла requirements.txt без кэширования
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все файлы из текущей директории на хосте в рабочую директорию контейнера
COPY . .

# Запускаем приложение Python, указывая файл app.py как точку входа
CMD ["python", "./app.py"]